"""
https://habr.com/ru/articles/750312/
https://habr.com/ru/companies/southbridge/articles/748176/


3.2. Декораторы функций - это простой способ модификации поведения любой функции без внесения изменения в ее код
или же - это функция, принимающая на вход функцию, и возвращающая (другую) функцию

3.2. Декораторы позволяют вам выполнить произвольный код до/после/вместо вызова функции, модифицируя ее входные аргументы, результат выполнения и добавляя различные сайд-эффекты.

Примеры отличного функционала для реализации через декорирование:
ретраи - tenacity
логирование ошибок - loguru
сериализация входящих данных - FastDepends
регистрация обработчиков - любой HTTP (и не только) фреймворк
"""





